leading-causes-death-ML/app/controllers/api/v1/diseases_controller.rb

SELECT id, year, leading_cause, sum(deaths) AS deaths, sex FROM "diseases" GROUP BY year, leading_cause, sex
---
    def index
        @diseases = Disease.select("id, year, leading_cause, sum(deaths) AS deaths, sex").group("year, leading_cause, sex")

SELECT  "diseases".* FROM "diseases" WHERE "diseases"."id" = ? LIMIT ?  [["id", 2766], ["LIMIT", 1]]
---
    def show
        @disease = Disease.find(params[:id])

INSERT INTO "diseases" ("year", "leading_cause", "sex", "deaths", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @disease = Disease.create(year: params[:year], leading_cause: params[:leading_cause], sex: params[:sex], deaths: params[:deaths])

SELECT  "diseases".* FROM "diseases" WHERE "diseases"."id" = ? LIMIT ?  [["id", 2766], ["LIMIT", 1]]
UPDATE "diseases" SET "deaths" = ?, "updated_at" = ? WHERE "diseases"."id" = ?  [["deaths", 4000], ["updated_at", "2018-12-31 06:58:45.946887"], ["id", 3986]]
---
    def update
        @disease = Disease.find(params[:id])
        @disease.update(year: params[:year], leading_cause: params[:leading_cause], sex: params[:sex], deaths: params[:deaths])

DELETE FROM "diseases" WHERE "diseases"."id" = ?  [["id", 3986]]
SELECT  "diseases".* FROM "diseases" WHERE "diseases"."id" = ? LIMIT ?  [["id", 3986], ["LIMIT", 1]]
---
    def destroy
        Disease.find(params[:id]).destroy