leading-causes-death-ML/app/controllers/api/v1/diseases_controller.rb

    def index
        @diseases = Disease.all
---
SELECT "diseases".* FROM "diseases"